"use strict";

// 阴阳(索引值为其常量)
export const Opposite =  ['阴', '阳'];

// 五行对应的颜色
export const EColor = ['#000000', '#339900', '#FF3300', '#996600', '#999999'];

// 五行(索引值为其常量)
export const Element = ['水', '木', '火', '土', '金'];

// 天干(索引值为其常量)
export const Gan = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'];

// 天干对应五行(较少使用，使用算法解决)
export const G2E = [1, 1, 2, 2, 3, 3, 4, 4, 0, 0];

// 地支(索引值为其常量)
export const Zhi = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];

// 地支对应五行索引(较少使用，使用算法解决)
export const Z2E = [0, 3, 1, 1, 3, 2, 2, 3, 4, 4, 3, 0];

// 地支藏干 第一个为本气(主气),第二个为中气,第三个为余气，
export const ZwG = [
    [9], [5, 7, 9], [0, 2, 4], [1], [4, 1, 9], [2, 6, 4], [3, 5], [5, 3, 1], [6, 8, 4], [7], [4, 7, 3], [8, 0]
];

// 五神(索引值为其常量)
export const Spirits5 = ['印绶', '比肩', '伤官', '妻财', '官杀'];

// 十神(索引值为其常量)
export const Spirits10 = [
    '印', '卩',
    '劫', '比',
    '伤', '食',
    '财', '才',
    '官', '杀'];

// 柱的名称定义
export const Columns = ['年', '月', '日', '时', '大运', '流年', '流月', '流日', '流时'];

// 12节气
export const SolarIterm = ['立春', '惊蛰', '清明', '立夏', '芒种', '小暑', '立秋', '白露', '寒露', '立冬', '大雪', '小寒']
